// Задача 19 Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет, 12821 -> да, 3432 -> да

System.Console.WriteLine("Enter five-digit number:     ");

string strNumberOne = Console.ReadLine();
int NumberA = Convert.ToInt32(strNumberOne);